/**
 * 종만북
 * 알고리즘 규칙
 * 1. 문제를 읽고 이해한다,
 * 2. 문제를 익숙한 용어로 재정의한다,
 * 3. 어떻게 해결할지 계획을 세운다,
 * 4. 계획을 검증한다,
 * 5. 프로그램으로 구현한다,
 * 6. 어떻게 풀었는지 돌아보고, 개선할 방법이 있는지 찾아본다,
 * 
 *  입문자를 위한 커리큘럼 2,3,4,6,7,8,18,19,21,22,23,27,28,29,30
 * 
 * 회고 - 끊임없이 풀었떤 문제를 풀어보고 다시보고 다시풀어보는 연습이 필요함,
 * 꼭 인터넷 사이트에서 풀어보고 다른사람과 비교해보고 내코드를 비교해보는 연습이 필요,
 * 문제를 풀지 못할때 너무 오래 문제를 잡고 있는것도 좋지 않음 일정 시간이 지나도록 고민해도 답을 찾지 못할떄 다른 사람의 소스코드나 풀이를 참조한 다는 원칙을 세우고 지키는 것이 좋음,
 * 자신이 문제를 해결할 때 취했던 접근들을 되새겨 보고 자신이 왜 이 풀이를 떠올리지 못했는지를 살펴봐야한다는 이야기임,
 * 
 * 직관과 체계적인 접근
 * 
 * 
 */